app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."title" = ?  [["title", "hello"]]
---
	def index
		if params[:q].present?
			@articles= Article.entitled(params[:q])
		else
			@articles = Article.all

INSERT INTO "articles" ("title", "text", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "jhe8hfe"], ["text", "hf8rhg\r\n"], ["author", "hufos"], ["created_at", "2015-03-16 23:40:21.108280"], ["updated_at", "2015-03-16 23:40:21.108280"]]
---
	def create
		@article = Article.new(article_params)

		if @article.save